# 参数
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 主干（原始 YOLO11）
backbone:
  - [-1, 1, nn.Identity, []] #0
  - [-1, 1, Conv, [64, 3, 2]]        # 1 P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 2 P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]       # 4 P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]       # 6 P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 8 P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]         # 10
  - [-1, 2, C2PSA, [1024]]           # 11

  # 并行分支：Swin（从输入图像 0 层开始）
  - [0, 1, SwinTransformerV2, []]  # 12: 返回 [P3s,P4s,P5s]
  - [12, 1, Index, [0]]  # 13: P3_swin, (B,256,H/8,W/8)
  - [12, 1, Index, [1]]  # 14: P4_swin, (B,512,H/16,W/16)
  - [12, 1, Index, [2]]  # 15: P5_swin, (B,1024,H/32,W/32)

# 头部（将 Swin 特征与原特征融合）
head:
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7, 14], 1, Concat, [1]]              # cat backbone P4
  - [-1, 2, C3k2, [512, False]]            # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5, 13], 1, Concat, [1]]              # cat backbone P3
  - [-1, 2, C3k2, [256, False]]            # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]             # cat head P4
  - [-1, 2, C3k2, [512, False]]            # 24 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11, 15], 1, Concat, [1]]             # cat head P5
  - [-1, 2, C3k2, [1024, True]]            # 27 (P5/32-large)

  - [[21, 24, 27], 1, Detect, [nc]]